app/controllers/offers_controller.rb

SELECT * FROM "offers"
---
  def index
    @offers = Offer.all