app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "account_id", "failed_login_count", "current_login_ip", "is_admin", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "surname", "last_login_at", "email") VALUES('Patrick', 'JpGFw_tfXs4Vd3oncWc8', '2010-01-11 19:28:53', '2010-01-11 19:28:53', '3483b37958442c7cd8586b7a80933b7752bb3ae788cabac35a5397cb638bfde2f71d1010ffd1db0e235574544ee806d405f7e8c6dd039f6db8cecf275a01c9de', 'P-n6gtmK7bwmIEkhFmgB', '2010-01-11 19:28:53', NULL, 0, '127.0.0.1', 't', 'ERvlBg3EzSv_OU1jXX4m', '2010-01-11 19:28:53', '01678e55c1025eebfb4ef8f43c8905e4db31ddf098ecbd560523687897cb15ba727cc4a18720d67400aadee9204f2974bd4533fbd9fae595a07da7623ca35989', 1, NULL, 'patrick.heneise', 'Heneise', NULL, 'patrick.heneise@nachtschicht-gbr.de')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "login_count" = 2, "persistence_token" = '010f42feda195a3ea77689e0aefdfd702e78c09896bedac158358629eec5d3827a271ebc8ab3e56a6ada899f762b2b4698535365029af8d1f53df73a6b2f18d1', "updated_at" = '2010-01-10 20:35:33', "perishable_token" = 'FFoDvw5cy_vckl9QyRjv', "last_request_at" = '2010-01-10 20:35:33', "last_login_at" = '2010-01-10 20:32:57', "last_login_ip" = '127.0.0.1', "current_login_at" = '2010-01-10 20:35:33', "password_salt" = 'XLikRID1dlllJtAvdqVo', "crypted_password" = '2ccbafe2427ebbb075a881822f967310cc438dbcfbbe21d10964fbf4999b8115f80c291ea0c828e87537b446a5f7faa354a5a8cf866104c163c9ab60e5f93985' WHERE "id" = 1